apache/nuttx/arch/arm/src/xmc4/hardware/xmc4_pinmux.h
/************************************************************************************
 * arch/arm/src/xmc4/hardware/xmc4_pinmux.h
 *
 *   Copyright (C) 2017 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *
 * Reference: XMC4500 Reference Manual V1.5 2014-07 Microcontrollers.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ************************************************************************************/

#ifndef __ARCH_ARM_SRC_XMC4_HARDWARE_XMC4_PINMUX_H
#define __ARCH_ARM_SRC_XMC4_HARDWARE_XMC4_PINMUX_H

/************************************************************************************
 * Included Files
 ************************************************************************************/

#include <nuttx/config.h>

/************************************************************************************
 * Pre-processor Definitions
 ************************************************************************************/
/* Alternate Pin Functions.  All members of the XMC4xxx family share the same
 * pin multiplexing (although they may differ in the pins physically available).
 *
 * Alternative pin selections are provided with a numeric suffix like _1, _2, etc.
 * Drivers, however, will use the pin selection without the numeric suffix.
 * Additional definitions are required in the board.h file.  For example, if
 * CAN_N2TXD connects vis P1.9 on some board, then the following definition should
 * appear in the board.h header file for that board:
 *
 * #define GPIO_CAN_N2TXD GPIO_CAN_N2TXD_1
 *
 * The driver will then automatically configre PA11 as the CAN1 RX pin.
 */

/* WARNING!!! WARNING!!! WARNING!!! WARNING!!! WARNING!!! WARNING!!! WARNING!!!
 * Additional effort is required to select specific GPIO options such as frequency,
 * open-drain/push-pull, and pull-up/down!  Just the basics are defined for most
 * pins in this file.
 */

#define GPIO_CAN_N0RXDA          (GPIO_INPUT | GPIO_PORT1 | GPIO_PIN5)
#define GPIO_CAN_N0RXDB          (GPIO_INPUT | GPIO_PORT14 | GPIO_PIN3)
#define GPIO_CAN_N0RXDC          (GPIO_INPUT | GPIO_PORT3 | GPIO_PIN12)
#define GPIO_CAN_N0TXD_1         (GPIO_OUTPUT_ALT2 | GPIO_PORT0 | GPIO_PIN0)
#define GPIO_CAN_N0TXD_2         (GPIO_OUTPUT_ALT2 | GPIO_PORT1 | GPIO_PIN4)
#define GPIO_CAN_N0TXD_3         (GPIO_OUTPUT_ALT2 | GPIO_PORT3 | GPIO_PIN10)
#define GPIO_CAN_N0TXD_4         (GPIO_OUTPUT_ALT2 | GPIO_PORT3 | GPIO_PIN2)
#define GPIO_CAN_N1RXDA          (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN6)
#define GPIO_CAN_N1RXDB          (GPIO_INPUT | GPIO_PORT3 | GPIO_PIN11)
#define GPIO_CAN_N1RXDC          (GPIO_INPUT | GPIO_PORT1 | GPIO_PIN13)
#define GPIO_CAN_N1RXDD          (GPIO_INPUT | GPIO_PORT1 | GPIO_PIN4)
#define GPIO_CAN_N1TXD_1         (GPIO_OUTPUT_ALT1 | GPIO_PORT1 | GPIO_PIN5)
#define GPIO_CAN_N1TXD_2         (GPIO_OUTPUT_ALT2 | GPIO_PORT1 | GPIO_PIN12)
#define GPIO_CAN_N1TXD_3         (GPIO_OUTPUT_ALT2 | GPIO_PORT2 | GPIO_PIN7)
#define GPIO_CAN_N1TXD_4         (GPIO_OUTPUT_ALT2 | GPIO_PORT3 | GPIO_PIN9)
#define GPIO_CAN_N2RXDA          (GPIO_INPUT | GPIO_PORT1 | GPIO_PIN8)
#define GPIO_CAN_N2RXDB          (GPIO_INPUT | GPIO_PORT3 | GPIO_PIN8)
#define GPIO_CAN_N2RXDC          (GPIO_INPUT | GPIO_PORT4 | GPIO_PIN6)
#define GPIO_CAN_N2TXD_1         (GPIO_OUTPUT_ALT2 | GPIO_PORT1 | GPIO_PIN9)
#define GPIO_CAN_N2TXD_2         (GPIO_OUTPUT_ALT2 | GPIO_PORT3 | GPIO_PIN7)
#define GPIO_CAN_N2TXD_3         (GPIO_OUTPUT_ALT2 | GPIO_PORT4 | GPIO_PIN7)

#define GPIO_CCU40_IN0A          (GPIO_INPUT | GPIO_PORT1 | GPIO_PIN3)
#define GPIO_CCU40_IN0B          (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN8)
#define GPIO_CCU40_IN0C          (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN1)
#define GPIO_CCU40_IN1A          (GPIO_INPUT | GPIO_PORT1 | GPIO_PIN2)
#define GPIO_CCU40_IN1B          (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN8)
#define GPIO_CCU40_IN1C          (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN0)
#define GPIO_CCU40_IN2A          (GPIO_INPUT | GPIO_PORT1 | GPIO_PIN1)
#define GPIO_CCU40_IN2B          (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN8)
#define GPIO_CCU40_IN2C          (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN7)
#define GPIO_CCU40_IN3A          (GPIO_INPUT | GPIO_PORT1 | GPIO_PIN0)
#define GPIO_CCU40_IN3B          (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN8)
#define GPIO_CCU40_IN3C          (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN6)
#define GPIO_CCU40_OUT0_1        (GPIO_OUTPUT_ALT3 | GPIO_PORT0 | GPIO_PIN15)
#define GPIO_CCU40_OUT0_2        (GPIO_OUTPUT_ALT3 | GPIO_PORT1 | GPIO_PIN3)
#define GPIO_CCU40_OUT1_1        (GPIO_OUTPUT_ALT3 | GPIO_PORT0 | GPIO_PIN14)
#define GPIO_CCU40_OUT1_2        (GPIO_OUTPUT_ALT3 | GPIO_PORT1 | GPIO_PIN2)
#define GPIO_CCU40_OUT2_1        (GPIO_OUTPUT_ALT3 | GPIO_PORT0 | GPIO_PIN13)
#define GPIO_CCU40_OUT2_2        (GPIO_OUTPUT_ALT3 | GPIO_PORT1 | GPIO_PIN1)
#define GPIO_CCU40_OUT3_1        (GPIO_OUTPUT_ALT3 | GPIO_PORT0 | GPIO_PIN12)
#define GPIO_CCU40_OUT3_2        (GPIO_OUTPUT_ALT3 | GPIO_PORT1 | GPIO_PIN0)
#define GPIO_CCU41_IN0A          (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN5)
#define GPIO_CCU41_IN0B          (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN9)
#define GPIO_CCU41_IN0C          (GPIO_INPUT | GPIO_PORT1 | GPIO_PIN4)
#define GPIO_CCU41_IN1A          (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN4)
#define GPIO_CCU41_IN1B          (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN9)
#define GPIO_CCU41_IN1C          (GPIO_INPUT | GPIO_PORT1 | GPIO_PIN5)
#define GPIO_CCU41_IN2A          (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN3)
#define GPIO_CCU41_IN2B          (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN9)
#define GPIO_CCU41_IN2C          (GPIO_INPUT | GPIO_PORT1 | GPIO_PIN10)
#define GPIO_CCU41_IN3A          (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN2)
#define GPIO_CCU41_IN3B          (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN9)
#define GPIO_CCU41_IN3C          (GPIO_INPUT | GPIO_PORT1 | GPIO_PIN11)
#define GPIO_CCU41_OUT0_1        (GPIO_OUTPUT_ALT3 | GPIO_PORT2 | GPIO_PIN5)
#define GPIO_CCU41_OUT0_2        (GPIO_OUTPUT_ALT3 | GPIO_PORT3 | GPIO_PIN10)
#define GPIO_CCU41_OUT1_1        (GPIO_OUTPUT_ALT3 | GPIO_PORT2 | GPIO_PIN4)
#define GPIO_CCU41_OUT1_2        (GPIO_OUTPUT_ALT3 | GPIO_PORT3 | GPIO_PIN9)
#define GPIO_CCU41_OUT2_1        (GPIO_OUTPUT_ALT3 | GPIO_PORT2 | GPIO_PIN3)
#define GPIO_CCU41_OUT2_2        (GPIO_OUTPUT_ALT3 | GPIO_PORT3 | GPIO_PIN8)
#define GPIO_CCU41_OUT3_1        (GPIO_OUTPUT_ALT3 | GPIO_PORT2 | GPIO_PIN2)
#define GPIO_CCU41_OUT3_2        (GPIO_OUTPUT_ALT3 | GPIO_PORT3 | GPIO_PIN7)
#define GPIO_CCU42_IN0A          (GPIO_INPUT | GPIO_PORT3 | GPIO_PIN6)
#define GPIO_CCU42_IN0B          (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN15)
#define GPIO_CCU42_IN0C          (GPIO_INPUT | GPIO_PORT3 | GPIO_PIN15)
#define GPIO_CCU42_IN1A          (GPIO_INPUT | GPIO_PORT3 | GPIO_PIN5)
#define GPIO_CCU42_IN1B          (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN15)
#define GPIO_CCU42_IN1C          (GPIO_INPUT | GPIO_PORT3 | GPIO_PIN14)
#define GPIO_CCU42_IN2A          (GPIO_INPUT | GPIO_PORT3 | GPIO_PIN4)
#define GPIO_CCU42_IN2B          (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN15)
#define GPIO_CCU42_IN2C          (GPIO_INPUT | GPIO_PORT0 | GPIO_PIN15)
#define GPIO_CCU42_IN3A          (GPIO_INPUT | GPIO_PORT3 | GPIO_PIN3)
#define GPIO_CCU42_IN3B          (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN15)
#define GPIO_CCU42_IN3C          (GPIO_INPUT | GPIO_PORT0 | GPIO_PIN14)
#define GPIO_CCU42_OUT0_1        (GPIO_OUTPUT_ALT3 | GPIO_PORT3 | GPIO_PIN0)
#define GPIO_CCU42_OUT0_2        (GPIO_OUTPUT_ALT3 | GPIO_PORT3 | GPIO_PIN6)
#define GPIO_CCU42_OUT1_1        (GPIO_OUTPUT_ALT3 | GPIO_PORT3 | GPIO_PIN13)
#define GPIO_CCU42_OUT1_2        (GPIO_OUTPUT_ALT3 | GPIO_PORT3 | GPIO_PIN5)
#define GPIO_CCU42_OUT2_1        (GPIO_OUTPUT_ALT3 | GPIO_PORT3 | GPIO_PIN12)
#define GPIO_CCU42_OUT2_2        (GPIO_OUTPUT_ALT3 | GPIO_PORT3 | GPIO_PIN4)
#define GPIO_CCU42_OUT3_1        (GPIO_OUTPUT_ALT3 | GPIO_PORT3 | GPIO_PIN11)
#define GPIO_CCU42_OUT3_2        (GPIO_OUTPUT_ALT3 | GPIO_PORT3 | GPIO_PIN3)
#define GPIO_CCU43_IN0A          (GPIO_INPUT | GPIO_PORT4 | GPIO_PIN6)
#define GPIO_CCU43_IN0B          (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN14)
#define GPIO_CCU43_IN0C          (GPIO_INPUT | GPIO_PORT4 | GPIO_PIN7)
#define GPIO_CCU43_IN1A          (GPIO_INPUT | GPIO_PORT4 | GPIO_PIN5)
#define GPIO_CCU43_IN1B          (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN14)
#define GPIO_CCU43_IN1C          (GPIO_INPUT | GPIO_PORT4 | GPIO_PIN2)
#define GPIO_CCU43_IN2A          (GPIO_INPUT | GPIO_PORT4 | GPIO_PIN4)
#define GPIO_CCU43_IN2B          (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN14)
#define GPIO_CCU43_IN2C          (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN13)
#define GPIO_CCU43_IN3A          (GPIO_INPUT | GPIO_PORT4 | GPIO_PIN3)
#define GPIO_CCU43_IN3B          (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN14)
#define GPIO_CCU43_IN3C          (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN12)
#define GPIO_CCU43_OUT0_1        (GPIO_OUTPUT_ALT3 | GPIO_PORT4 | GPIO_PIN6)
#define GPIO_CCU43_OUT0_2        (GPIO_OUTPUT_ALT3 | GPIO_PORT6 | GPIO_PIN5)
#define GPIO_CCU43_OUT1_1        (GPIO_OUTPUT_ALT3 | GPIO_PORT4 | GPIO_PIN5)
#define GPIO_CCU43_OUT1_2        (GPIO_OUTPUT_ALT3 | GPIO_PORT6 | GPIO_PIN4)
#define GPIO_CCU43_OUT2_1        (GPIO_OUTPUT_ALT3 | GPIO_PORT4 | GPIO_PIN4)
#define GPIO_CCU43_OUT2_2        (GPIO_OUTPUT_ALT3 | GPIO_PORT6 | GPIO_PIN3)
#define GPIO_CCU43_OUT3_1        (GPIO_OUTPUT_ALT3 | GPIO_PORT4 | GPIO_PIN3)
#define GPIO_CCU43_OUT3_2        (GPIO_OUTPUT_ALT3 | GPIO_PORT6 | GPIO_PIN2)
#define GPIO_CCU80_IN0A          (GPIO_INPUT | GPIO_PORT0 | GPIO_PIN7)
#define GPIO_CCU80_IN0B          (GPIO_INPUT | GPIO_PORT3 | GPIO_PIN4)
#define GPIO_CCU80_IN0C          (GPIO_INPUT | GPIO_PORT3 | GPIO_PIN2)
#define GPIO_CCU80_IN1A          (GPIO_INPUT | GPIO_PORT0 | GPIO_PIN7)
#define GPIO_CCU80_IN1B          (GPIO_INPUT | GPIO_PORT0 | GPIO_PIN8)
#define GPIO_CCU80_IN1C          (GPIO_INPUT | GPIO_PORT3 | GPIO_PIN1)
#define GPIO_CCU80_IN2A          (GPIO_INPUT | GPIO_PORT0 | GPIO_PIN7)
#define GPIO_CCU80_IN2B          (GPIO_INPUT | GPIO_PORT0 | GPIO_PIN6)
#define GPIO_CCU80_IN2C          (GPIO_INPUT | GPIO_PORT3 | GPIO_PIN0)
#define GPIO_CCU80_IN3A          (GPIO_INPUT | GPIO_PORT0 | GPIO_PIN7)
#define GPIO_CCU80_IN3B          (GPIO_INPUT | GPIO_PORT3 | GPIO_PIN3)
#define GPIO_CCU80_IN3C          (GPIO_INPUT | GPIO_PORT3 | GPIO_PIN13)
#define GPIO_CCU80_OUT00_1       (GPIO_OUTPUT_ALT3 | GPIO_PORT0 | GPIO_PIN5)
#define GPIO_CCU80_OUT00_2       (GPIO_OUTPUT_ALT3 | GPIO_PORT5 | GPIO_PIN11)
#define GPIO_CCU80_OUT01_1       (GPIO_OUTPUT_ALT3 | GPIO_PORT0 | GPIO_PIN2)
#define GPIO_CCU80_OUT01_2       (GPIO_OUTPUT_ALT3 | GPIO_PORT5 | GPIO_PIN8)
#define GPIO_CCU80_OUT02 1       (GPIO_OUTPUT_ALT3 | GPIO_PORT0 | GPIO_PIN10)
#define GPIO_CCU80_OUT03 2       (GPIO_OUTPUT_ALT3 | GPIO_PORT2 | GPIO_PIN7)
#define GPIO_CCU80_OUT10_1       (GPIO_OUTPUT_ALT3 | GPIO_PORT0 | GPIO_PIN4)
#define GPIO_CCU80_OUT10_2       (GPIO_OUTPUT_ALT3 | GPIO_PORT5 | GPIO_PIN10)
#define GPIO_CCU80_OUT11_1       (GPIO_OUTPUT_ALT3 | GPIO_PORT0 | GPIO_PIN1)
#define GPIO_CCU80_OUT11_2       (GPIO_OUTPUT_ALT3 | GPIO_PORT2 | GPIO_PIN15)
#define GPIO_CCU80_OUT12         (GPIO_OUTPUT_ALT3 | GPIO_PORT0 | GPIO_PIN9)
#define GPIO_CCU80_OUT13         (GPIO_OUTPUT_ALT3 | GPIO_PORT2 | GPIO_PIN6)
#define GPIO_CCU80_OUT20_1       (GPIO_OUTPUT_ALT3 | GPIO_PORT0 | GPIO_PIN3)
#define GPIO_CCU80_OUT20_2       (GPIO_OUTPUT_ALT3 | GPIO_PORT5 | GPIO_PIN9)
#define GPIO_CCU80_OUT21_1       (GPIO_OUTPUT_ALT3 | GPIO_PORT0 | GPIO_PIN0)
#define GPIO_CCU80_OUT21_2       (GPIO_OUTPUT_ALT3 | GPIO_PORT2 | GPIO_PIN14)
#define GPIO_CCU80_OUT22_1       (GPIO_OUTPUT_ALT3 | GPIO_PORT2 | GPIO_PIN11)
#define GPIO_CCU80_OUT22_2       (GPIO_OUTPUT_ALT3 | GPIO_PORT2 | GPIO_PIN9)
#define GPIO_CCU80_OUT23         (GPIO_OUTPUT_ALT3 | GPIO_PORT1 | GPIO_PIN5)
#define GPIO_CCU80_OUT30         (GPIO_OUTPUT_ALT3 | GPIO_PORT0 | GPIO_PIN6)
#define GPIO_CCU80_OUT31         (GPIO_OUTPUT_ALT3 | GPIO_PORT0 | GPIO_PIN11)
#define GPIO_CCU80_OUT32         (GPIO_OUTPUT_ALT3 | GPIO_PORT2 | GPIO_PIN8)
#define GPIO_CCU80_OUT33         (GPIO_OUTPUT_ALT3 | GPIO_PORT1 | GPIO_PIN4)
#define GPIO_CCU81_IN0A          (GPIO_INPUT | GPIO_PORT5 | GPIO_PIN0)
#define GPIO_CCU81_IN0B          (GPIO_INPUT | GPIO_PORT5 | GPIO_PIN1)
#define GPIO_CCU81_IN0C          (GPIO_INPUT | GPIO_PORT3 | GPIO_PIN0)
#define GPIO_CCU81_IN1A          (GPIO_INPUT | GPIO_PORT5 | GPIO_PIN0)
#define GPIO_CCU81_IN1B          (GPIO_INPUT | GPIO_PORT5 | GPIO_PIN2)
#define GPIO_CCU81_IN1C          (GPIO_INPUT | GPIO_PORT3 | GPIO_PIN13)
#define GPIO_CCU81_IN2A          (GPIO_INPUT | GPIO_PORT5 | GPIO_PIN0)
#define GPIO_CCU81_IN2B          (GPIO_INPUT | GPIO_PORT5 | GPIO_PIN3)
#define GPIO_CCU81_IN2C          (GPIO_INPUT | GPIO_PORT3 | GPIO_PIN12)
#define GPIO_CCU81_IN3A          (GPIO_INPUT | GPIO_PORT5 | GPIO_PIN0)
#define GPIO_CCU81_IN3B          (GPIO_INPUT | GPIO_PORT5 | GPIO_PIN4)
#define GPIO_CCU81_IN3C          (GPIO_INPUT | GPIO_PORT3 | GPIO_PIN11)
#define GPIO_CCU81_OUT00         (GPIO_OUTPUT_ALT3 | GPIO_PORT1 | GPIO_PIN15)
#define GPIO_CCU81_OUT01_1       (GPIO_OUTPUT_ALT2 | GPIO_PORT2 | GPIO_PIN2)
#define GPIO_CCU81_OUT01_2       (GPIO_OUTPUT_ALT3 | GPIO_PORT1 | GPIO_PIN12)
#define GPIO_CCU81_OUT02         (GPIO_OUTPUT_ALT3 | GPIO_PORT5 | GPIO_PIN7)
#define GPIO_CCU81_OUT03         (GPIO_OUTPUT_ALT3 | GPIO_PORT5 | GPIO_PIN6)
#define GPIO_CCU81_OUT10_1       (GPIO_OUTPUT_ALT3 | GPIO_PORT1 | GPIO_PIN14)
#define GPIO_CCU81_OUT10_2       (GPIO_OUTPUT_ALT4 | GPIO_PORT1 | GPIO_PIN5)
#define GPIO_CCU81_OUT11_1       (GPIO_OUTPUT_ALT2 | GPIO_PORT2 | GPIO_PIN1)
#define GPIO_CCU81_OUT11_2       (GPIO_OUTPUT_ALT3 | GPIO_PORT1 | GPIO_PIN11)
#define GPIO_CCU81_OUT12         (GPIO_OUTPUT_ALT3 | GPIO_PORT5 | GPIO_PIN5)
#define GPIO_CCU81_OUT13         (GPIO_OUTPUT_ALT3 | GPIO_PORT5 | GPIO_PIN4)
#define GPIO_CCU81_OUT20_1       (GPIO_OUTPUT_ALT3 | GPIO_PORT1 | GPIO_PIN13)
#define GPIO_CCU81_OUT20_2       (GPIO_OUTPUT_ALT4 | GPIO_PORT1 | GPIO_PIN4)
#define GPIO_CCU81_OUT21_1       (GPIO_OUTPUT_ALT2 | GPIO_PORT2 | GPIO_PIN0)
#define GPIO_CCU81_OUT21_2       (GPIO_OUTPUT_ALT3 | GPIO_PORT1 | GPIO_PIN10)
#define GPIO_CCU81_OUT22         (GPIO_OUTPUT_ALT3 | GPIO_PORT5 | GPIO_PIN3)
#define GPIO_CCU81_OUT23         (GPIO_OUTPUT_ALT3 | GPIO_PORT5 | GPIO_PIN2)
#define GPIO_CCU81_OUT30         (GPIO_OUTPUT_ALT3 | GPIO_PORT6 | GPIO_PIN1)
#define GPIO_CCU81_OUT31         (GPIO_OUTPUT_ALT3 | GPIO_PORT6 | GPIO_PIN0)
#define GPIO_CCU81_OUT32         (GPIO_OUTPUT_ALT3 | GPIO_PORT5 | GPIO_PIN1)
#define GPIO_CCU81_OUT33_1       (GPIO_OUTPUT_ALT3 | GPIO_PORT2 | GPIO_PIN12)
#define GPIO_CCU81_OUT33_2       (GPIO_OUTPUT_ALT3 | GPIO_PORT5 | GPIO_PIN0)

#define GPIO_DAC_OUT0            (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT14 | GPIO_PIN8)
#define GPIO_DAC_OUT1            (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT14 | GPIO_PIN9)

#define GPIO_DAC_TRIGGER4        (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN9)
#define GPIO_DAC_TRIGGER5        (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN8)
#define GPIO_DB_ETMTRACECLK_1    (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT2 | GPIO_PIN14)
#define GPIO_DB_ETMTRACECLK_2    (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT6 | GPIO_PIN0)
#define GPIO_DB_ETMTRACEDATA0_1  (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT2 | GPIO_PIN13)
#define GPIO_DB_ETMTRACEDATA0_2  (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT6 | GPIO_PIN6)
#define GPIO_DB_ETMTRACEDATA1_1  (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT2 | GPIO_PIN12)
#define GPIO_DB_ETMTRACEDATA1_2  (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT6 | GPIO_PIN5)
#define GPIO_DB_ETMTRACEDATA2_1  (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT2 | GPIO_PIN11)
#define GPIO_DB_ETMTRACEDATA2_2  (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT6 | GPIO_PIN2)
#define GPIO_DB_ETMTRACEDATA3_1  (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT2 | GPIO_PIN10)
#define GPIO_DB_ETMTRACEDATA3_2  (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT6 | GPIO_PIN1)
#define GPIO_DB_TDI              (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT0 | GPIO_PIN7)
#define GPIO_DB_TDO              (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT2 | GPIO_PIN1)

