apache/nuttx/arch/arm/src/xmc4/hardware/xmc4_pinmux.h
#define GPIO_SDMMC_BUSPOWER      (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT3 | GPIO_PIN4)
#define GPIO_SDMMC_CLKIN         (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT3 | GPIO_PIN6)
#define GPIO_SDMMC_CLKOUT        (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT3 | GPIO_PIN6)
#define GPIO_SDMMC_CMDIN         (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT3 | GPIO_PIN5)
#define GPIO_SDMMC_CMDOUT        (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT3 | GPIO_PIN5)
#define GPIO_SDMMC_DATA0IN       (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT4 | GPIO_PIN0)
#define GPIO_SDMMC_DATA0OUT      (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT4 | GPIO_PIN0)
#define GPIO_SDMMC_DATA1IN       (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT1 | GPIO_PIN6)
#define GPIO_SDMMC_DATA1OUT      (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT1 | GPIO_PIN6)
#define GPIO_SDMMC_DATA2IN       (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT1 | GPIO_PIN7)
#define GPIO_SDMMC_DATA2OUT      (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT1 | GPIO_PIN7)
#define GPIO_SDMMC_DATA3IN       (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT4 | GPIO_PIN1)
#define GPIO_SDMMC_DATA3OUT      (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT4 | GPIO_PIN1)
#define GPIO_SDMMC_DATA4IN       (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT1 | GPIO_PIN8)
#define GPIO_SDMMC_DATA4OUT      (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT1 | GPIO_PIN8)
#define GPIO_SDMMC_DATA5IN       (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT1 | GPIO_PIN9)
#define GPIO_SDMMC_DATA5OUT      (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT1 | GPIO_PIN9)
#define GPIO_SDMMC_DATA6IN       (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT1 | GPIO_PIN12)
#define GPIO_SDMMC_DATA6OUT      (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT1 | GPIO_PIN12)
#define GPIO_SDMMC_DATA7IN       (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT1 | GPIO_PIN13)
#define GPIO_SDMMC_DATA7OUT      (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT1 | GPIO_PIN13)
#define GPIO_SDMMC_LED           (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT3 | GPIO_PIN3)
#define GPIO_SDMMC_RST           (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT0 | GPIO_PIN11)
#define GPIO_SDMMC_SDCD          (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT1 | GPIO_PIN10)
#define GPIO_SDMMC_SDWC          (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT1 | GPIO_PIN1)
#define GPIO_TRACESWO            (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT2 | GPIO_PIN1)

#define GPIO_U0C0_DOUT0_1        (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT1 | GPIO_PIN5)
#define GPIO_U0C0_DOUT0_2        (GPIO_OUTPUT_ALT1 | GPIO_PORT5 | GPIO_PIN1)
#define GPIO_U0C0_DOUT0_3        (GPIO_OUTPUT_ALT2 | GPIO_PORT1 | GPIO_PIN5)
#define GPIO_U0C0_DOUT0_4        (GPIO_OUTPUT_ALT2 | GPIO_PORT1 | GPIO_PIN7)
#define GPIO_U0C0_DOUT1_1        (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT1 | GPIO_PIN4)
#define GPIO_U0C0_DOUT2_2        (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT1 | GPIO_PIN3)
#define GPIO_U0C0_DOUT3_3        (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT1 | GPIO_PIN2)
#define GPIO_U0C0_DX0A           (GPIO_INPUT | GPIO_PORT1 | GPIO_PIN5)
#define GPIO_U0C0_DX0B           (GPIO_INPUT | GPIO_PORT1 | GPIO_PIN4)
#define GPIO_U0C0_DX0C           (GPIO_INPUT | GPIO_PORT4 | GPIO_PIN7)
#define GPIO_U0C0_DX0D           (GPIO_INPUT | GPIO_PORT5 | GPIO_PIN0)
#define GPIO_U0C0_DX1A           (GPIO_INPUT | GPIO_PORT1 | GPIO_PIN1)
#define GPIO_U0C0_DX1B           (GPIO_INPUT | GPIO_PORT0 | GPIO_PIN8)
#define GPIO_U0C0_DX2A           (GPIO_INPUT | GPIO_PORT1 | GPIO_PIN0)
#define GPIO_U0C0_DX2B           (GPIO_INPUT | GPIO_PORT0 | GPIO_PIN7)
#define GPIO_U0C0_HWIN0          (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT1 | GPIO_PIN5)
#define GPIO_U0C0_HWIN1          (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT1 | GPIO_PIN4)
#define GPIO_U0C0_HWIN2          (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT1 | GPIO_PIN3)
#define GPIO_U0C0_HWIN3          (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT1 | GPIO_PIN2)
#define GPIO_U0C0_MCLKOUT        (GPIO_OUTPUT_ALT2 | GPIO_PORT1 | GPIO_PIN3)
#define GPIO_U0C0_SCLKOUT_1      (GPIO_OUTPUT_ALT2 | GPIO_PORT0 | GPIO_PIN8)
#define GPIO_U0C0_SCLKOUT_2      (GPIO_OUTPUT_ALT2 | GPIO_PORT1 | GPIO_PIN1)
#define GPIO_U0C0_SCLKOUT_3      (GPIO_OUTPUT_ALT2 | GPIO_PORT1 | GPIO_PIN10)
#define GPIO_U0C0_SCLKOUT_4      (GPIO_OUTPUT_ALT2 | GPIO_PORT1 | GPIO_PIN6)
#define GPIO_U0C0_SELO0_1        (GPIO_OUTPUT_ALT2 | GPIO_PORT0 | GPIO_PIN7)
#define GPIO_U0C0_SELO0_2        (GPIO_OUTPUT_ALT2 | GPIO_PORT1 | GPIO_PIN0)
#define GPIO_U0C0_SELO0_3        (GPIO_OUTPUT_ALT2 | GPIO_PORT1 | GPIO_PIN11)
#define GPIO_U0C0_SELO1          (GPIO_OUTPUT_ALT2 | GPIO_PORT1 | GPIO_PIN8)
#define GPIO_U0C0_SELO2          (GPIO_OUTPUT_ALT2 | GPIO_PORT4 | GPIO_PIN6)
#define GPIO_U0C0_SELO3          (GPIO_OUTPUT_ALT2 | GPIO_PORT4 | GPIO_PIN5)
#define GPIO_U0C0_SELO4          (GPIO_OUTPUT_ALT2 | GPIO_PORT4 | GPIO_PIN4)
#define GPIO_U0C0_SELO5          (GPIO_OUTPUT_ALT2 | GPIO_PORT4 | GPIO_PIN3)
#define GPIO_U0C1_DOUT0_1        (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT3 | GPIO_PIN13)
#define GPIO_U0C1_DOUT0_2        (GPIO_OUTPUT_ALT2 | GPIO_PORT2 | GPIO_PIN5)
#define GPIO_U0C1_DOUT0_3        (GPIO_OUTPUT_ALT2 | GPIO_PORT3 | GPIO_PIN13)
#define GPIO_U0C1_DOUT0_4        (GPIO_OUTPUT_ALT2 | GPIO_PORT6 | GPIO_PIN4)
#define GPIO_U0C1_DOUT0_5        (GPIO_OUTPUT_ALT4 | GPIO_PORT3 | GPIO_PIN5)
#define GPIO_U0C1_DOUT1          (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT3 | GPIO_PIN12)
#define GPIO_U0C1_DOUT2          (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT3 | GPIO_PIN11)
#define GPIO_U0C1_DOUT3          (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT3 | GPIO_PIN10)
#define GPIO_U0C1_DX0A           (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN2)
#define GPIO_U0C1_DX0B           (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN5)
#define GPIO_U0C1_DX0C           (GPIO_INPUT | GPIO_PORT6 | GPIO_PIN3)
#define GPIO_U0C1_DX0D           (GPIO_INPUT | GPIO_PORT3 | GPIO_PIN13)
#define GPIO_U0C1_DX0E           (GPIO_INPUT | GPIO_PORT4 | GPIO_PIN0)
#define GPIO_U0C1_DX1A           (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN4)
#define GPIO_U0C1_DX1B           (GPIO_INPUT | GPIO_PORT3 | GPIO_PIN0)
#define GPIO_U0C1_DX1C           (GPIO_INPUT | GPIO_PORT6 | GPIO_PIN2)
#define GPIO_U0C1_DX2A           (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN3)
#define GPIO_U0C1_DX2B           (GPIO_INPUT | GPIO_PORT3 | GPIO_PIN1)
#define GPIO_U0C1_DX2C           (GPIO_INPUT | GPIO_PORT6 | GPIO_PIN1)
#define GPIO_U0C1_HWIN0          (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT3 | GPIO_PIN13)
#define GPIO_U0C1_HWIN1          (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT3 | GPIO_PIN12)
#define GPIO_U0C1_HWIN2          (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT3 | GPIO_PIN11)
#define GPIO_U0C1_HWIN3          (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT3 | GPIO_PIN10)
#define GPIO_U0C1_MCLKOUT        (GPIO_OUTPUT_ALT2 | GPIO_PORT6 | GPIO_PIN5)
#define GPIO_U0C1_SCLKOUT_1      (GPIO_OUTPUT_ALT2 | GPIO_PORT2 | GPIO_PIN4)
#define GPIO_U0C1_SCLKOUT_2      (GPIO_OUTPUT_ALT2 | GPIO_PORT3 | GPIO_PIN0)
#define GPIO_U0C1_SCLKOUT_3      (GPIO_OUTPUT_ALT2 | GPIO_PORT6 | GPIO_PIN2)
#define GPIO_U0C1_SCLKOUT_4      (GPIO_OUTPUT_ALT4 | GPIO_PORT3 | GPIO_PIN6)
#define GPIO_U0C1_SELO0_1        (GPIO_OUTPUT_ALT2 | GPIO_PORT2 | GPIO_PIN3)
#define GPIO_U0C1_SELO0_2        (GPIO_OUTPUT_ALT2 | GPIO_PORT3 | GPIO_PIN1)
#define GPIO_U0C1_SELO0_3        (GPIO_OUTPUT_ALT2 | GPIO_PORT6 | GPIO_PIN1)
#define GPIO_U0C1_SELO0_4        (GPIO_OUTPUT_ALT4 | GPIO_PORT4 | GPIO_PIN1)
#define GPIO_U0C1_SELO1_1        (GPIO_OUTPUT_ALT2 | GPIO_PORT3 | GPIO_PIN12)
#define GPIO_U0C1_SELO1_2        (GPIO_OUTPUT_ALT2 | GPIO_PORT6 | GPIO_PIN0)
#define GPIO_U0C1_SELO2_1        (GPIO_OUTPUT_ALT2 | GPIO_PORT1 | GPIO_PIN14)
#define GPIO_U0C1_SELO2_2        (GPIO_OUTPUT_ALT2 | GPIO_PORT3 | GPIO_PIN11)
#define GPIO_U0C1_SELO3_1        (GPIO_OUTPUT_ALT2 | GPIO_PORT1 | GPIO_PIN13)
#define GPIO_U0C1_SELO3_2        (GPIO_OUTPUT_ALT2 | GPIO_PORT3 | GPIO_PIN8)
#define GPIO_U1C0_DOUT0_1        (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT0 | GPIO_PIN5)
#define GPIO_U1C0_DOUT0_2        (GPIO_OUTPUT_ALT2 | GPIO_PORT0 | GPIO_PIN5)
#define GPIO_U1C0_DOUT0_3        (GPIO_OUTPUT_ALT2 | GPIO_PORT2 | GPIO_PIN14)
#define GPIO_U1C0_DOUT1          (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT0 | GPIO_PIN4)
#define GPIO_U1C0_DOUT2          (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT0 | GPIO_PIN3)
#define GPIO_U1C0_DOUT3          (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT0 | GPIO_PIN2)
#define GPIO_U1C0_DX0A           (GPIO_INPUT | GPIO_PORT0 | GPIO_PIN4)
#define GPIO_U1C0_DX0B           (GPIO_INPUT | GPIO_PORT0 | GPIO_PIN5)
#define GPIO_U1C0_DX0C           (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN15)
#define GPIO_U1C0_DX0D           (GPIO_INPUT | GPIO_PORT2 | GPIO_PIN14)
#define GPIO_U1C0_DX1A           (GPIO_INPUT | GPIO_PORT0 | GPIO_PIN11)
#define GPIO_U1C0_DX1B           (GPIO_INPUT | GPIO_PORT5 | GPIO_PIN8)
#define GPIO_U1C0_DX2A           (GPIO_INPUT | GPIO_PORT0 | GPIO_PIN6)
#define GPIO_U1C0_DX2B           (GPIO_INPUT | GPIO_PORT5 | GPIO_PIN9)
#define GPIO_U1C0_HWIN0          (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT0 | GPIO_PIN5)
#define GPIO_U1C0_HWIN1          (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT0 | GPIO_PIN4)
#define GPIO_U1C0_HWIN2          (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT0 | GPIO_PIN3)
#define GPIO_U1C0_HWIN3          (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT0 | GPIO_PIN2)
#define GPIO_U1C0_MCLKOUT        (GPIO_OUTPUT_ALT2 | GPIO_PORT5 | GPIO_PIN10)
#define GPIO_U1C0_SCLKOUT_1      (GPIO_OUTPUT_ALT2 | GPIO_PORT0 | GPIO_PIN11)
#define GPIO_U1C0_SCLKOUT_2      (GPIO_OUTPUT_ALT2 | GPIO_PORT5 | GPIO_PIN8)
#define GPIO_U1C0_SELO0_1        (GPIO_OUTPUT_ALT2 | GPIO_PORT0 | GPIO_PIN6)
#define GPIO_U1C0_SELO0_2        (GPIO_OUTPUT_ALT2 | GPIO_PORT5 | GPIO_PIN9)
#define GPIO_U1C0_SELO1_1        (GPIO_OUTPUT_ALT2 | GPIO_PORT0 | GPIO_PIN14)
#define GPIO_U1C0_SELO1_2        (GPIO_OUTPUT_ALT2 | GPIO_PORT5 | GPIO_PIN11)
#define GPIO_U1C0_SELO2          (GPIO_OUTPUT_ALT2 | GPIO_PORT0 | GPIO_PIN15)
#define GPIO_U1C0_SELO3          (GPIO_OUTPUT_ALT2 | GPIO_PORT3 | GPIO_PIN14)
#define GPIO_U1C1_DOUT0_1        (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT3 | GPIO_PIN15)
#define GPIO_U1C1_DOUT0_2        (GPIO_OUTPUT_ALT2 | GPIO_PORT0 | GPIO_PIN1)
#define GPIO_U1C1_DOUT0_3        (GPIO_OUTPUT_ALT2 | GPIO_PORT3 | GPIO_PIN15)
#define GPIO_U1C1_DOUT0_4        (GPIO_OUTPUT_ALT2 | GPIO_PORT4 | GPIO_PIN2)
#define GPIO_U1C1_DOUT1          (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT3 | GPIO_PIN14)
#define GPIO_U1C1_DOUT2          (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT0 | GPIO_PIN15)
#define GPIO_U1C1_DOUT3          (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT0 | GPIO_PIN14)
#define GPIO_U1C1_DX0A           (GPIO_INPUT | GPIO_PORT3 | GPIO_PIN15)
#define GPIO_U1C1_DX0B           (GPIO_INPUT | GPIO_PORT3 | GPIO_PIN14)
#define GPIO_U1C1_DX0C           (GPIO_INPUT | GPIO_PORT4 | GPIO_PIN2)
#define GPIO_U1C1_DX0D           (GPIO_INPUT | GPIO_PORT0 | GPIO_PIN0)
#define GPIO_U1C1_DX1A           (GPIO_INPUT | GPIO_PORT0 | GPIO_PIN10)
#define GPIO_U1C1_DX1B           (GPIO_INPUT | GPIO_PORT0 | GPIO_PIN13)
#define GPIO_U1C1_DX1C           (GPIO_INPUT | GPIO_PORT4 | GPIO_PIN0)
#define GPIO_U1C1_DX2A           (GPIO_INPUT | GPIO_PORT0 | GPIO_PIN9)
#define GPIO_U1C1_DX2B           (GPIO_INPUT | GPIO_PORT0 | GPIO_PIN12)
#define GPIO_U1C1_HWIN0          (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT3 | GPIO_PIN15)
#define GPIO_U1C1_HWIN1          (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT3 | GPIO_PIN14)
#define GPIO_U1C1_HWIN2          (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT0 | GPIO_PIN15)
#define GPIO_U1C1_HWIN3          (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT0 | GPIO_PIN14)
#define GPIO_U1C1_SCLKOUT_1      (GPIO_OUTPUT_ALT2 | GPIO_PORT0 | GPIO_PIN10)
#define GPIO_U1C1_SCLKOUT_2      (GPIO_OUTPUT_ALT2 | GPIO_PORT0 | GPIO_PIN13)
#define GPIO_U1C1_SELO0_1        (GPIO_OUTPUT_ALT2 | GPIO_PORT0 | GPIO_PIN12)
#define GPIO_U1C1_SELO0_2        (GPIO_OUTPUT_ALT2 | GPIO_PORT0 | GPIO_PIN9)
#define GPIO_U1C1_SELO1_1        (GPIO_OUTPUT_ALT2 | GPIO_PORT0 | GPIO_PIN2)
#define GPIO_U1C1_SELO1_2        (GPIO_OUTPUT_ALT2 | GPIO_PORT3 | GPIO_PIN3)
#define GPIO_U1C1_SELO2          (GPIO_OUTPUT_ALT2 | GPIO_PORT3 | GPIO_PIN4)
#define GPIO_U1C1_SELO3          (GPIO_OUTPUT_ALT2 | GPIO_PORT3 | GPIO_PIN5)
#define GPIO_U1C1_SELO4          (GPIO_OUTPUT_ALT2 | GPIO_PORT3 | GPIO_PIN6)
#define GPIO_U2C0_DOUT0_1        (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT5 | GPIO_PIN0)
#define GPIO_U2C0_DOUT0_2        (GPIO_OUTPUT_ALT1 | GPIO_PORT3 | GPIO_PIN8)
#define GPIO_U2C0_DOUT0_3        (GPIO_OUTPUT_ALT1 | GPIO_PORT5 | GPIO_PIN0)
#define GPIO_U2C0_DOUT1          (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT5 | GPIO_PIN1)
#define GPIO_U2C0_DOUT2          (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT5 | GPIO_PIN7)
#define GPIO_U2C0_DOUT3          (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT2 | GPIO_PIN6)
#define GPIO_U2C0_DX0A           (GPIO_INPUT | GPIO_PORT5 | GPIO_PIN1)
#define GPIO_U2C0_DX0B           (GPIO_INPUT | GPIO_PORT5 | GPIO_PIN0)
#define GPIO_U2C0_DX0C           (GPIO_INPUT | GPIO_PORT3 | GPIO_PIN7)
#define GPIO_U2C0_DX1A           (GPIO_INPUT | GPIO_PORT5 | GPIO_PIN2)
#define GPIO_U2C0_DX2A           (GPIO_INPUT | GPIO_PORT5 | GPIO_PIN3)
#define GPIO_U2C0_HWIN0          (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT5 | GPIO_PIN0)
#define GPIO_U2C0_HWIN1          (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT5 | GPIO_PIN1)
#define GPIO_U2C0_HWIN2          (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT5 | GPIO_PIN7)
#define GPIO_U2C0_HWIN3          (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT2 | GPIO_PIN6)
#define GPIO_U2C0_SCLKOUT_1      (GPIO_OUTPUT_ALT1 | GPIO_PORT3 | GPIO_PIN9)
#define GPIO_U2C0_SCLKOUT_2      (GPIO_OUTPUT_ALT1 | GPIO_PORT5 | GPIO_PIN2)
#define GPIO_U2C0_SELO0_1        (GPIO_OUTPUT_ALT1 | GPIO_PORT3 | GPIO_PIN10)
#define GPIO_U2C0_SELO0_2        (GPIO_OUTPUT_ALT1 | GPIO_PORT5 | GPIO_PIN3)
#define GPIO_U2C0_SELO1          (GPIO_OUTPUT_ALT1 | GPIO_PORT5 | GPIO_PIN4)
#define GPIO_U2C0_SELO2          (GPIO_OUTPUT_ALT1 | GPIO_PORT5 | GPIO_PIN5)
#define GPIO_U2C0_SELO3          (GPIO_OUTPUT_ALT1 | GPIO_PORT5 | GPIO_PIN6)
#define GPIO_U2C0_SELO4          (GPIO_OUTPUT_ALT1 | GPIO_PORT2 | GPIO_PIN6)
#define GPIO_U2C1_DOUT0_1        (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT4 | GPIO_PIN7)
#define GPIO_U2C1_DOUT0_2        (GPIO_OUTPUT_ALT1 | GPIO_PORT3 | GPIO_PIN11)
#define GPIO_U2C1_DOUT0_3        (GPIO_OUTPUT_ALT1 | GPIO_PORT3 | GPIO_PIN5)
#define GPIO_U2C1_DOUT1          (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT4 | GPIO_PIN6)
#define GPIO_U2C1_DOUT2          (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT4 | GPIO_PIN5)
#define GPIO_U2C1_DOUT3          (GPIO_OUTPUT | GPIO_PINCTRL_HW0 | GPIO_PORT4 | GPIO_PIN4)
#define GPIO_U2C1_DX0A           (GPIO_INPUT | GPIO_PORT3 | GPIO_PIN5)
#define GPIO_U2C1_DX0B           (GPIO_INPUT | GPIO_PORT3 | GPIO_PIN4)
#define GPIO_U2C1_DX0C           (GPIO_INPUT | GPIO_PORT4 | GPIO_PIN0)
#define GPIO_U2C1_DX0D           (GPIO_INPUT | GPIO_PORT3 | GPIO_PIN12)
#define GPIO_U2C1_DX1A           (GPIO_INPUT | GPIO_PORT4 | GPIO_PIN2)
#define GPIO_U2C1_DX1B           (GPIO_INPUT | GPIO_PORT3 | GPIO_PIN6)
#define GPIO_U2C1_DX2A           (GPIO_INPUT | GPIO_PORT4 | GPIO_PIN1)
#define GPIO_U2C1_DX2B           (GPIO_INPUT | GPIO_PORT4 | GPIO_PIN1)
#define GPIO_U2C1_HWIN0          (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT4 | GPIO_PIN7)
#define GPIO_U2C1_HWIN1          (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT4 | GPIO_PIN6)
#define GPIO_U2C1_HWIN2          (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT4 | GPIO_PIN5)
#define GPIO_U2C1_HWIN3          (GPIO_INPUT | GPIO_PINCTRL_HW0 | GPIO_PORT4 | GPIO_PIN4)
#define GPIO_U2C1_MCLKOUT        (GPIO_OUTPUT_ALT1 | GPIO_PORT3 | GPIO_PIN4)
#define GPIO_U2C1_SCLKOUT_1      (GPIO_OUTPUT_ALT1 | GPIO_PORT3 | GPIO_PIN13)
#define GPIO_U2C1_SCLKOUT_2      (GPIO_OUTPUT_ALT1 | GPIO_PORT3 | GPIO_PIN6)
#define GPIO_U2C1_SCLKOUT_3      (GPIO_OUTPUT_ALT4 | GPIO_PORT4 | GPIO_PIN2)
#define GPIO_U2C1_SELO0_1        (GPIO_OUTPUT_ALT1 | GPIO_PORT3 | GPIO_PIN0)
#define GPIO_U2C1_SELO0_2        (GPIO_OUTPUT_ALT1 | GPIO_PORT4 | GPIO_PIN1)
#define GPIO_U2C1_SELO1          (GPIO_OUTPUT_ALT1 | GPIO_PORT4 | GPIO_PIN2)
#define GPIO_U2C1_SELO2          (GPIO_OUTPUT_ALT1 | GPIO_PORT4 | GPIO_PIN3)

#define GPIO_USB_DRIVEVBUS_1     (GPIO_OUTPUT_ALT1 | GPIO_PORT0 | GPIO_PIN1)
#define GPIO_USB_DRIVEVBUS_2     (GPIO_OUTPUT_ALT1 | GPIO_PORT3 | GPIO_PIN2)
#define GPIO_USB_ID              (GPIO_INPUT | GPIO_PORT0 | GPIO_PIN9)

#define GPIO_VADC_EMUX00         (GPIO_OUTPUT_ALT1 | GPIO_PORT2 | GPIO_PIN2)
#define GPIO_VADC_EMUX01         (GPIO_OUTPUT_ALT1 | GPIO_PORT2 | GPIO_PIN3)
#define GPIO_VADC_EMUX02         (GPIO_OUTPUT_ALT1 | GPIO_PORT2 | GPIO_PIN4)
#define GPIO_VADC_EMUX10         (GPIO_OUTPUT_ALT1 | GPIO_PORT2 | GPIO_PIN10)
#define GPIO_VADC_EMUX11         (GPIO_OUTPUT_ALT1 | GPIO_PORT2 | GPIO_PIN14)
#define GPIO_VADC_EMUX12         (GPIO_OUTPUT_ALT1 | GPIO_PORT2 | GPIO_PIN15)
#define GPIO_VADC_G0CH0          (GPIO_INPUT | GPIO_PORT14 | GPIO_PIN0)
#define GPIO_VADC_G0CH1          (GPIO_INPUT | GPIO_PORT14 | GPIO_PIN1)
#define GPIO_VADC_G0CH2          (GPIO_INPUT | GPIO_PORT14 | GPIO_PIN2)
#define GPIO_VADC_G0CH3          (GPIO_INPUT | GPIO_PORT14 | GPIO_PIN3)
#define GPIO_VADC_G0CH4          (GPIO_INPUT | GPIO_PORT14 | GPIO_PIN4)
#define GPIO_VADC_G0CH5          (GPIO_INPUT | GPIO_PORT14 | GPIO_PIN5)
#define GPIO_VADC_G0CH6          (GPIO_INPUT | GPIO_PORT14 | GPIO_PIN6)
#define GPIO_VADC_G0CH7          (GPIO_INPUT | GPIO_PORT14 | GPIO_PIN7)
#define GPIO_VADC_G1CH0          (GPIO_INPUT | GPIO_PORT14 | GPIO_PIN8)
#define GPIO_VADC_G1CH1          (GPIO_INPUT | GPIO_PORT14 | GPIO_PIN9)
#define GPIO_VADC_G1CH2          (GPIO_INPUT | GPIO_PORT14 | GPIO_PIN2)
#define GPIO_VADC_G1CH3          (GPIO_INPUT | GPIO_PORT14 | GPIO_PIN3)
#define GPIO_VADC_G1CH4          (GPIO_INPUT | GPIO_PORT14 | GPIO_PIN12)
#define GPIO_VADC_G1CH5          (GPIO_INPUT | GPIO_PORT14 | GPIO_PIN13)
#define GPIO_VADC_G1CH6          (GPIO_INPUT | GPIO_PORT14 | GPIO_PIN14)
#define GPIO_VADC_G1CH7          (GPIO_INPUT | GPIO_PORT14 | GPIO_PIN15)
#define GPIO_VADC_G2CH0          (GPIO_INPUT | GPIO_PORT14 | GPIO_PIN4)
#define GPIO_VADC_G2CH1          (GPIO_INPUT | GPIO_PORT14 | GPIO_PIN5)
#define GPIO_VADC_G2CH2          (GPIO_INPUT | GPIO_PORT15 | GPIO_PIN2)
#define GPIO_VADC_G2CH3          (GPIO_INPUT | GPIO_PORT15 | GPIO_PIN3)
#define GPIO_VADC_G2CH4          (GPIO_INPUT | GPIO_PORT15 | GPIO_PIN4)
#define GPIO_VADC_G2CH5          (GPIO_INPUT | GPIO_PORT15 | GPIO_PIN5)
#define GPIO_VADC_G2CH6          (GPIO_INPUT | GPIO_PORT15 | GPIO_PIN6)
#define GPIO_VADC_G2CH7          (GPIO_INPUT | GPIO_PORT15 | GPIO_PIN7)
#define GPIO_VADC_G3CH0          (GPIO_INPUT | GPIO_PORT15 | GPIO_PIN8)
#define GPIO_VADC_G3CH1          (GPIO_INPUT | GPIO_PORT15 | GPIO_PIN9)
#define GPIO_VADC_G3CH2          (GPIO_INPUT | GPIO_PORT14 | GPIO_PIN8)
#define GPIO_VADC_G3CH3          (GPIO_INPUT | GPIO_PORT14 | GPIO_PIN9)
#define GPIO_VADC_G3CH4          (GPIO_INPUT | GPIO_PORT15 | GPIO_PIN12)
#define GPIO_VADC_G3CH5          (GPIO_INPUT | GPIO_PORT15 | GPIO_PIN13)
#define GPIO_VADC_G3CH6          (GPIO_INPUT | GPIO_PORT15 | GPIO_PIN14)
#define GPIO_VADC_G3CH7          (GPIO_INPUT | GPIO_PORT15 | GPIO_PIN15)

#define GPIO_WWDT_SERVICEOUT_1   (GPIO_OUTPUT_ALT1 | GPIO_PORT0 | GPIO_PIN7)
#define GPIO_WWDT_SERVICEOUT_2   (GPIO_OUTPUT_ALT1 | GPIO_PORT1 | GPIO_PIN4)

#endif /* __ARCH_ARM_SRC_XMC4_HARDWARE_XMC4_PINMXU_H */
